app/Controllers/Aparatos.php

    public function new()
    {
        $reglas = [
            'tipo'    => 'required|is_not_unique[tipo_aparatos.idTipo]',
            'marca'   => 'required',
            'modelo'  => 'required',
            'serie'   => 'required',
            'disco'   => 'permit_empty|decimal',
            'ram'     => 'permit_empty|decimal',
            'so'      => 'permit_empty',
            'propiedad'=> 'permit_empty',
            'acciones' => 'permit_empty',
            'valor_compra' => 'permit_empty|decimal',
            'fecha_compra' => 'permit_empty',
            'area'    => 'required|is_not_unique[areas.idArea]',
        ];

        if (!$this->validate($reglas)) {
            return redirect()->back()->withInput()->with('error', $this->validator->listErrors());
        }

        $post = $this->request->getPost();

        $this->aparatosModel->insert([
            'tipo'     => trim($post['tipo']),
            'marca'    => trim($post['marca']),
            'modelo'   => trim($post['modelo']),
            'serie'    => trim($post['serie']),
            'disco'    => $post['disco'] ?? null,
            'ram'      => $post['ram'] ?? null,
            'so'       => $post['so'] ?? null,
            'propiedad'=> $post['propiedad'] ?? null,
            'acciones' => $post['acciones'] ?? null,
            'fecha_compra' => $post['fecha_compra'] ?? null,
            'valor_compra' => $post['valor_compra'] ?? null,

            'area'     => trim($post['area']),
        ]);
---
INSERT INTO `aparatos` (`tipo`, `marca`, `modelo`, `serie`, `disco`, `ram`, `so`, `propiedad`, `acciones`, `fecha_compra`, `valor_compra`, `area`) VALUES ('2', 'LENOVO', '3', 'A', '2000', '20', 'MAC', 'TRC', '10', '2021-02-22', '50000', '5')