app/Controllers/Responsivas.php

SELECT *
FROM `responsivas`
---
    public function index()
    {
        $data['responsivas'] = $this->responsivasModel->findAll();

SELECT *
FROM `empleados`
SELECT *
FROM `aparatos`
---
    public function create()
    {
        $data['empleados'] = $this->empleadosModel->findAll();
        $data['aparatos'] = $this->aparatosModel->findAll();

INSERT INTO `responsivas` (`idEmpleado`, `idAparato`, `fecha_inicio`, `fecha_fin`) VALUES ('9', '19', '2024-10-02 15:49:10', NULL)
---
    public function new()
    {
        $rules = [
            'idEmpleado' => 'required|is_not_unique[empleados.idEmpleado]',
            'idAparato' => 'required|is_not_unique[aparatos.idAparato]',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('error', $this->validator->listErrors());
        }

        $post = $this->request->getPost();

        // Insertar nueva responsiva
        $idResponsiva = $this->responsivasModel->insert([
            'idEmpleado' => trim($post['idEmpleado']),
            'idAparato' => trim($post['idAparato']),
            'fecha_inicio' => date('Y-m-d H:i:s'),
            'fecha_fin' => null,
        ]);

UPDATE `responsivas` SET `fecha_fin` = '2024-10-02 15:52:05'
WHERE `responsivas`.`idResponsiva` IN ('43')
---
    public function darBaja($id = null)
    {
        $responsiva = $this->responsivasModel->find($id);
        if (!$responsiva) {
            return redirect()->to('/responsivas')->with('error', 'Responsiva no encontrada.');
        }

        // Actualiza la fecha_fin con la fecha actual
        $this->responsivasModel->update($id, [
            'fecha_fin' => date('Y-m-d H:i:s'),
        ]);