app/Controllers/Tipo_aparatos.php

    public function index()
    {
        $data['tipos_aparatos'] = $this->tipoModel->findAll(); // Obtener todos los tipos
---
SELECT *
FROM `tipo_aparatos`