app/Models/AparatosModel.php

    public function AparatosTipo()
    {
        return $this->select('aparatos.*, tipo_aparatos.nombreTipo AS tipo')
            ->join('tipo_aparatos', 'aparatos.tipo = tipo_aparatos.idTipo')
            ->findAll();
---
SELECT `aparatos`.*, `tipo_aparatos`.`nombreTipo` AS `tipo`
FROM `aparatos`
JOIN `tipo_aparatos` ON `aparatos`.`tipo` = `tipo_aparatos`.`idTipo`

    public function AparatosArea()
    {
        return $this->select('aparatos.*, areas.nombreArea AS area')
            ->join('areas', 'aparatos.area = areas.idArea')
            ->findAll();
---
SELECT `aparatos`.*, `areas`.`nombreArea` AS `area`
FROM `aparatos`
JOIN `areas` ON `aparatos`.`area` = `areas`.`idArea`